using UnityEngine;
namespace BFS
{
    public class FSREADME
    {
        // 플레이어 4마리가 게임 내에 있을 텐데, 서버를 몰라서 일단 만들어 놓았음. 나중에 삭제하든 수정하든 상관 없음

        // 게임 설명:

        // 포 사이드 게임. 개인전으로 진행되며 떨어지지 않고 버티는게 목표입니다.
        // 총 N개의 스테이지가 있고, 스테이지 시작 시 카메라가 중앙 모니터에 집중되며 여러 색깔이 순차적으로 나옴.
        // 그 후 게임 화면, 4개의 발판과 플레이어가 보이는 화면으로 집중됨.
        // 전에 모니터에서 보여졌던 순서대로 해당 색을 지닌 발판들이 카운트다운과 함께 사라짐.
        // 스테이지가 진행될 수록 난이도가 어려워지며(순서의 길이 증가, 카운트다운 시간 감소 등)
        // 최후의 1인이 되거나 마지막 스테이지까지 살아남으면 승리!

        // 궁금한거 있으면 물어보세요!
        // - 따봉 -
    }
}
