namespace BFS
{
    public class TOWREADME
    {
        // 플레이어들한테 각각 주어진 IsTarget은 다 False로 적용되어 있을텐데, IsTarget이 True인 플레이어의 입력만 받도록 설정되어있음.
        // 서버 해야되는데 플레이어들이 있어야 하고, 서버는 하나도 몰라서 일단 만들어놓은 임시 기능
        // 스페이스 키 눌러서 게임 시작; 이 기능은 임시이므로 나중에 변경해야 함

        // 게임 설명:

        // 줄다리기 게임. 2개의 팀이 있고 각 플레이어들에게 WASD 중 하나를 눌러야 하는 미니게임이 주어짐.
        // 옳은 키를 누르면 1점을 얻고, 줄이 자신의 진영으로 이동하게 됨.
        // 잘못된 키를 누른다면 1점을 잃으며 줄이 상대 진영으로 이동하게 됨(만약 자신의 팀 점수가 0이라면 이로 인해 줄이 이동하진 않음. 또한 점수는 0미만으로 내려갈 수 없음)
        // 주어진 시간 내에 최대한 점수를 많이 얻어서 제한 시간 종료 후 상대보다 점수가 높으면 승리하지만, 각 팀의 점수 차가 25이상이면 게임이 즉시 종료됨.

        // 궁금한거 있으면 언제든지 물어봐도 됩니다
        // - 따봉 -
    }
}
